'''
某种编码由六位二进制码组成，前三位表示方向，后三位表示距离。
输入一组六位二进制码,将编码翻译成方向和距离，距离值为每组编码后三位二进制码转换为十进制数的值。
'''

s =input("输入六位二进制：")
n = len(s)
i = 0
while  i <= n-1:
    c =s[i:i+3]
    if c == "000":
        d = "东"
    elif c == "001":
        d = "东南"
    elif c == "010":
        d = "南"
    elif c == "011":
        d = "西南"
    elif c == "100":
        d = "西"
    elif c == "101":
        d = "西北"
    elif c == "110":
        d = "北"
    else:
        d = "东北"
    b1 = int(s[i + 3])
    b2 = int(s[i + 4])
    b3 = int(s[__①__])
    v=__②__                                            #实现三位二进制编码到十进制的转化
    print( __③__ +" " + str(v))             #按格式要求打印输出，如：东  7
    __④__                                            #调整i的值





